{
	"person": {
		"name": "Giulia",
		"surname": "Alfonsi"
	},
	"contact": {
		"tel": "{#telephone#}",
		"email": "{#email#}",
		"address": {
			"street-address": "{#street-address#}",
			"locality": "{#locality#}",
			"postal-code": "{#postal-code#}"
		},
		"github": "electricg",
		"linkedin": "in/giuliaalfonsi"
	},
	"about": {
		"items": [
			{
				"title": "Nationality",
				"value": ["Italian"]
			},
			{
				"title": "Spoken languages",
				"value": ["Italian (native)", "English (native)"]
			}
		]
	},
	"portfolio": {
		"title": "giugee.com/portfolio",
		"link": "http://giugee.com/portfolio"
	},
	"intro": {
		"items": [
			"I started studying HTML in 1998 during high school, and since then I've never stopped learning about the new technologies that arise in the web, keeping myself updated through the use of RSS feeds, newsletters, Twitter and by attending conferences.",
			"I'm not a “9-to-5” coder. I live this job as one of my passion and, as such, I put as much effort as I can into it, by studying everyday, trying to find best solutions for every task and by getting full understanding of my technical choices. Thus I expect to work for a company who considers this as a must for every developer, since I want to share knowledge with my colleagues and improve myself day by day with them."
		]
	},
	"skills": {
		"items": [
			"HTML5 / SVG",
			"CSS / CSS3 (responsive, adaptive, crossdevice, crossbrowser)",
			"Sass / SCSS / PostCSS",
			"JavaScript (ES6, DOM manipulation, Canvas, Progressive Web Apps)",
			"React.js / Redux",
			"jQuery",
			"Node.js",
			"MongoDB",
			"PHP5 / MySql / LAMP",
			"Git",
			"Mac, Windows, Linux (Debian/Ubuntu)"
		]
	},
	"employment": {
		"items": [
			{
				"show": true,
				"role": "Senior Front-End Platform Engineer",
				"when": {
					"from": "2017-07-10",
					"to": "2018-03-21"
				},
				"where": {
					"company": "Clique",
					"location": "Vancouver, Canada"
				},
				"what": [
					"I work with the Web Applications Platform team, the Product team and the UX team to deliver various features and functionalities for the company multidomain websites, <a target='_blank' href='http://www.whowhatwear.com'>WhoWhatWear</a>, <a target='_blank' href='http://www.mydomaine.com'>MyDomaine</a> and <a target='_blank' href='http://www.byrdie.com'>Byrdie</a>.",
					"I collaborate with the designer in creating style guides and reusable web components that are consistent under both the user experience aspect and the development aspect.",
					"I define and lead company-wide adoption of JavaScript, React.js and CSS development best practices and standards.",
					"I mentor and review the JavaScript, React.js and CSS development work of other developers."
				]
			},
			{
				"show": true,
				"role": "Senior Developer",
				"when": {
					"from": "2017-02-21",
					"to": "2017-06-30"
				},
				"where": {
					"company": "Brilliant Noise",
					"location": "Brighton, UK"
				},
				"what": [
					"I develop internal web apps and tools to help the company with their tasks, using mainly Node.js, WordPress and Google API.",
					"I collaborate daily with the designers, the project managers and the client partners to understand their needs and to strategize and plan the best course of actions to help them meet the clients' digital needs.",
					"I am the technical manager of another developer, managing their tasks, mentoring them and guiding them towards better code and new technical solutions."
				]
			},
			{
				"show": true,
				"role": "Senior Front End Developer & Technical Lead",
				"when": {
					"from": "2016-09-05",
					"to": "2017-01-31"
				},
				"where": {
					"company": "Chroma Sports",
					"location": "Brighton, UK"
				},
				"what": [
					"I am the technical lead of the redevelopment of the multi-domain multi-country sports betting website. The project involves creating a fast, light, responsive website that runs smoothly on low-end Android smartphones, the main type of devices used by our customers in Africa.",
					"I collaborate daily with the API developers to build a system that follows the REST standards and that meets the needs of our product, and I review the JavaScript and CSS of the other developers, while also coding features and checking weekly with the product manager that we are meeting the requirements."
				]
			},
			{
				"show": true,
				"role": "Software Engineer",
				"when": {
					"from": "2014-09-17",
					"to": "2016-05-31"
				},
				"where": {
					"company": "Ocasta Studios",
					"location": "Brighton, UK"
				},
				"what": [
					"I am the lead front end developer in a mixed team of web, back end, iOS and Android developers.",
					"I am the main developer on the <a target='_blank' href='http://electricomics.net'>Electricomics</a> project, a self-publishing ecosystem for digital comics which lets you create, package, and publish your own web digital comics with open source frameworks.",
					"I collaborate with the comics writers and artists to bring to the web four of their stories, experimenting with the possibilities given by the browsers API like device tilting, animations, sounds, user interactions, all using the latest JavaScript and CSS techniques.",
					"Using NW.js (a precursor of Electron) and Node.js, I create two desktop apps: one allows user with no development knowledge to create comics in HTML by simply drag&dropping images into a canvas; the other is the reader of said digital comics, that downloads, stores and shows the collections of web comics created by the community.",
					"I am also responsible for the development of REST API servers using Node.js, hapi.js and MongoDB with full test coverage and TDD methodology."
				]
			},
			{
				"show": true,
				"role": "Front End / JavaScript Developer &mdash; Contract",
				"when": {
					"from": "2014-02-25",
					"to": "2014-08-22"
				},
				"where": {
					"company": "Left Logic",
					"location": "Brighton, UK"
				},
				"what": [
					"I work on <a target='_blank' href='http://jsbin.com/'>JS Bin</a>, a code sharing site that enables users to learn, experiment and teach using web technologies. I develop using vanilla JavaScript on the front end and Node.js with Express on the back end.",
					"I also work on the website for <a target='_blank' href='http://2014.full-frontal.org/'>Full Frontal</a>, the UK's leading JavaScript conference, for which I use the latest SVG and CSS responsive techniques."
				]
			},
			{
				"show": true,
				"role": "Front End Developer",
				"when": {
					"from": "2013-06-17",
					"to": "2014-02-21"
				},
				"where": {
					"company": "DC Storm",
					"location": "Brighton, UK"
				},
				"what": [
					"I develop the user interface of DC Storm web applications using Ext JS, JavaScript and CSS.",
					"I work with the other developers to create excellent code and solutions and to help each other improve our skills."
				]
			},
			{
				"show": true,
				"role": "Front End Developer",
				"when": {
					"from": "2012-05-17",
					"to": "2013-04-30"
				},
				"where": {
					"company": "Tizuni",
					"location": "Brighton, UK"
				},
				"what": [
					"I develop the front end code for our clients' projects, using HTML, CSS, Sass, JavaScript and jQuery, through the last cutting-edge techniques to support all the variety of devices, resolutions and bandwidths.",
					"I collaborate daily with the back end developers, the project manager and the clients to make sure we deliver on time, on budget and on scope."
				]
			},
			{
				"show": false,
				"role": "Developer",
				"when": {
					"from": "2012-02-13",
					"to": "2012-04-19"
				},
				"where": {
					"company": "Epic",
					"location": "Brighton, UK"
				},
				"what": [
					"I develop DHTML interfaces for e-learning applications, supporting a wide range of browsers (from Internet Explorer 6 to the latest modern ones), operating systems and devices (desktop, smartphones, tablets)."
				]
			},
			{
				"show": true,
				"role": "User Interface Developer",
				"when": {
					"from": "2011-03-14",
					"to": "2012-02-10"
				},
				"where": {
					"company": "Pure360",
					"location": "Brighton, UK"
				},
				"what": [
					"I perform all aspects of product and custom software UI development with future-proofing, reusability of code and platform compatibility (from the latest browsers down to Internet Explorer 7, with an eye for the mobile support).",
					"I provide knowledge and suggestion in relation to UI architecture, design, best practice and latest UI development techniques and methodologies."
				]
			},
			{
				"show": false,
				"role": "Freelance Web Developer",
				"when": {
					"from": "2010-11-01",
					"to": "2011-01-31"
				},
				"where": {
					"company": "Digitalinnovation",
					"location": "Italy"
				}
			},
			{
				"show": true,
				"role": "Web Developer",
				"when": {
					"from": "2008-01-28",
					"to": "2010-04-16"
				},
				"where": {
					"company": "Digitalinnovation",
					"location": "Italy"
				},
				"what": [
					"I create XHTML/CSS/JavaScript templates from PSD files, using SEO friendly markup and crossbrowser techniques.",
					"Using PHP and MySQL, I develop cms to facilitate the management of websites for small and big companies.",
					"I am involved in the planning and development of web-based accounting software, which is custom-made according to our client's needs and daily feedbacks, using object-oriented PHP, AJAX, RTF (for the creation of printed documents) and jQuery. I also successfully installed and managed a LAMP server in the company offices."
				]
			},
			{
				"show": false,
				"role": "IT support and sales advisor",
				"when": {
					"from": "2002-12-04",
					"to": "2003-08-31"
				},
				"where": {
					"company": "Centro Computer Parma"
				},
				"what": [
					"I assembled and sold computers and gave software, hardware and on-site advice and assistance. I developed websites and accounting software using ASP and Access."
				]
			}
		]
	}
}